BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
#include "EasyWebRemoteControl.h"
#ifdef ESP32
#include "esp_task_wdt.h"
#include "esp_idf_version.h"
#include "esp_random.h"
// mbedTLS — bundled with the ESP32 core; used for real AES-256-GCM + PBKDF2.
#include "mbedtls/gcm.h"
#include "mbedtls/pkcs5.h"
#include "mbedtls/md.h"
#include "mbedtls/base64.h"
#endif

// -------- static --------
EasyWebRemoteControl* EasyWebRemoteControl::instance = nullptr;

// -------- ctor --------
EasyWebRemoteControl::EasyWebRemoteControl() //Constructor. Builds the server on port 80 and the WebSocket on /ws through the initializer list (mandatory — neither has a default constructor). Stores this in the static pointer, the bridge through which static handlers reach the object's state. Touches no hardware: it runs before setup().
    : server(80), ws("/ws"),
    currentPWM(0), sliderEnabled(true),
    lastApIPPrinted((uint32_t)0), lastStaIPPrinted((uint32_t)0)
{
    instance = this;
}

// -------- optional configuration (call BEFORE begin...) --------
void EasyWebRemoteControl::setAPConfig(IPAddress ip, IPAddress gateway, IPAddress subnet) //Sets a fixed IP, gateway and subnet for Access Point mode. Must be called before beginAP.
{
    apStaticSet = true; apIP = ip; apGW = gateway; apSN = subnet;
}
void EasyWebRemoteControl::clearAPConfig() { apStaticSet = false; } //Reverts to the default Access Point address.

void EasyWebRemoteControl::setSTAStatic(IPAddress ip, IPAddress gateway, IPAddress subnet,
    IPAddress dns1, IPAddress dns2) //Sets a static IP for Station mode, including DNS servers. Called before beginSTA.
{
    staStaticSet = true; staIP = ip; staGW = gateway; staSN = subnet; staDNS1 = dns1; staDNS2 = dns2;
}
void EasyWebRemoteControl::clearSTAStatic() { staStaticSet = false; } //Reverts to automatic address assignment via DHCP.

void EasyWebRemoteControl::setHostName(const char* host) //Sets the hostname visible on the network (Station mode only). Empty string disables it.
{
    if (host) hostName = host;
    else      hostName = "";
}

// ---- Auto-recovery configuration (public) ----
void EasyWebRemoteControl::enableAutoRecovery(bool enable) //Turns automatic reconnection on or off.
{
    autoRecoveryEnabled = enable;
}

void EasyWebRemoteControl::setAutoRecoveryTimings(int32_t reconnectWindowMs,
    int32_t rebootAfterMs,
    uint32_t checkIntervalMs,
    uint32_t reconnectAfterMs,
    uint32_t reconnectPeriodMs) //Configures the five timings of the reconnection state machine: retry window, reboot threshold, check interval, initial grace delay, and spacing between attempts.
{
    ar_reconnectWindowMs = reconnectWindowMs;
    ar_rebootAfterMs = rebootAfterMs;
    ar_checkIntervalMs = checkIntervalMs;
    ar_reconnectAfterMs = reconnectAfterMs;
    ar_reconnectPeriodMs = reconnectPeriodMs;
}

// -------- bring-up: AP / STA / Dual (UNCHANGED) --------
void EasyWebRemoteControl::beginAP(const char* ssid, const char* password) //Starts the board in Access Point mode: it creates its own network, no router needed. Applies the static IP if configured, then starts the server, the watchdog, and prints the addresses.
{
    WiFi.mode(WIFI_AP);
    if (apStaticSet) {
        if (!WiFi.softAPConfig(apIP, apGW, apSN)) {
            Serial.println("[AP] softAPConfig failed; using defaults.");
        }
    }
    WiFi.softAP(ssid, password);
    Serial.print("[AP] IP: ");
    Serial.println(WiFi.softAPIP());
    startServer();
    initWatchdogIfNeeded();
    printUrlsIfChanged(true);
}

void EasyWebRemoteControl::beginSTA(const char* ssid, const char* password, uint32_t connectTimeoutMs) //Connects the board to an existing network. Waits for the connection until the timeout expires, then starts the server regardless of the outcome so the device stays diagnosable. The only blocking section in the library, and it runs once, inside setup.
{
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(autoRecoveryEnabled);
    if (hostName.length()) {
        WiFi.setHostname(hostName.c_str());
    }
    if (staStaticSet) {
        if (!WiFi.config(staIP, staGW, staSN, staDNS1, staDNS2)) {
            Serial.println("[STA] WiFi.config failed; falling back to DHCP.");
        }
    }
    WiFi.begin(ssid, password);
    Serial.print("[STA] Connecting: "); Serial.print(ssid);
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - start) < connectTimeoutMs) {
        delay(100);
        Serial.print(".");
    }
    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
        Serial.print("[STA] IP: ");
        Serial.println(WiFi.localIP());
        lastStaSeenConnectedMs = millis();
        staDisconnectSinceMs = 0;
    }
    else {
        Serial.println("[STA] connect timeout; starting server anyway.");
    }
    startServer();
    initWatchdogIfNeeded();
    printUrlsIfChanged(true);
}

void EasyWebRemoteControl::beginDual(const char* apSsid, const char* apPassword,
    const char* staSsid, const char* staPassword,
    uint32_t connectTimeoutMs) //Starts both modes at once: joins an existing network while also offering its own fallback network. If the connection fails, the Access Point stays active.
{
    WiFi.mode(WIFI_AP_STA);
    WiFi.setAutoReconnect(autoRecoveryEnabled);
    if (apStaticSet) {
        if (!WiFi.softAPConfig(apIP, apGW, apSN)) {
            Serial.println("[AP] softAPConfig failed; using defaults.");
        }
    }
    WiFi.softAP(apSsid, apPassword);
    Serial.print("[AP] IP: ");
    Serial.println(WiFi.softAPIP());
    if (hostName.length()) {
        WiFi.setHostname(hostName.c_str());
    }
    if (staStaticSet) {
        if (!WiFi.config(staIP, staGW, staSN, staDNS1, staDNS2)) {
            Serial.println("[STA] WiFi.config failed; falling back to DHCP.");
        }
    }
    WiFi.begin(staSsid, staPassword);
    Serial.print("[STA] Connecting: "); Serial.print(staSsid);
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - start) < connectTimeoutMs) {
        delay(100);
        Serial.print(".");
    }
    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
        Serial.print("[STA] IP: ");
        Serial.println(WiFi.localIP());
        lastStaSeenConnectedMs = millis();
        staDisconnectSinceMs = 0;
    }
    else {
        Serial.println("[STA] connect timeout; AP remains active.");
    }
    startServer();
    initWatchdogIfNeeded();
    printUrlsIfChanged(true);
}

// -------- server wiring (generates WS token if auth is on) --------
void EasyWebRemoteControl::startServer() //Prepares and starts the server. Generates the WebSocket token if authentication is on, generates the key-derivation salt if encryption is on, warns about unavailable TLS, then registers the handlers and routes.
{
    // Generate a WebSocket auth token if authentication is enabled and the
    // user did not provide one explicitly.
    if (authEnabled && !wsTokenSet) {
        wsToken = genToken();
    }

