BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
    // generate a random salt for PBKDF2 key derivation (encryption).
    if (encryptionEnabled && pbkdfSalt.length() == 0) {
        pbkdfSalt = genToken();  // 32 hex chars = 16 bytes of salt
    }

    if (tlsEnabled) {
        // TLS is only available on a TLS-capable server build (needs PSRAM).
        // On the standard ESPAsyncWebServer this is a no-op; we warn and fall
        // back to plain HTTP so the device still works.
        Serial.println("[SEC] TLS requested but standard build serves plain HTTP; "
            "use a PSRAM board with a TLS-capable server for HTTPS/WSS.");
    }

    ws.onEvent(onWsEvent);
    server.addHandler(&ws);
    addHttpRoutes();
    server.begin();
    Serial.println("[HTTP] Server started.");
    if (authEnabled)       Serial.println("[SEC] Authentication ENABLED.");
    if (encryptionEnabled) Serial.println("[SEC] Command encryption ENABLED (AES-256-GCM).");
}

void EasyWebRemoteControl::addHttpRoutes() //Registers the two HTTP routes. The "/" route checks the IP filter, then authentication, rotates the token, and serves the page with security headers attached. The "/snapshot" route requests a frame from the provider and transmits it without copying, releasing it after the send.
{
    server.on("/", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!instance) { request->send(500, "text/plain", "No instance"); return; }
        if (!instance->ipFilterOK(request)) return;   // 403 if IP not permitted
        if (!instance->httpAuthOK(request)) return;    // sends 401/403 as needed

        // rotate the WebSocket token on each page load if requested.
        if (instance->authEnabled && instance->rotateTokenPerLoad && !instance->wsTokenSet) {
            
            instance->wsToken = instance->genToken();
        }

        // Build a response so we can attach security headers.
        AsyncWebServerResponse* resp =
            request->beginResponse(200, "text/html", instance->buildHtmlPage());

        resp->addHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
        instance->addSecurityHeaders(resp);
        request->send(resp);
        });
    server.on("/snapshot", HTTP_GET, [](AsyncWebServerRequest* req) {
        if (!instance) { req->send(500, "text/plain", "No instance"); return; }
        if (!instance->ipFilterOK(req)) return;
        if (instance->authEnabled && instance->protectSnapshot) {
            if (!instance->httpAuthOK(req)) return;
        }
        if (!instance->videoEnabled || instance->videoPaused || !instance->frameProvider) {
            req->send(204);
            return;
        }
        VideoFrame f;
        bool ok = instance->frameProvider(f);
        if (!ok || !f.data || f.len == 0) {
            req->send(204);
            return;
        }
        AsyncWebServerResponse* resp = req->beginResponse_P(200, f.mime ? f.mime : "image/jpeg", f.data, f.len);
        resp->addHeader("Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
        instance->addSecurityHeaders(resp);
        req->send(resp);
        if (f.release) f.release(f.data);
        });
}

// -------- update --------
void EasyWebRemoteControl::update() //Periodic maintenance, called from the main loop: clears dead WebSocket clients, feeds the watchdog, checks the Wi-Fi state, and prints the address if it changed.
{
    ws.cleanupClients();
    serviceWatchdog();
    checkAndRecoverWiFi();
    printUrlsIfChanged(false);
    if (WiFi.getMode() & WIFI_MODE_STA) {
        static bool printed = false;
        if (WiFi.status() == WL_CONNECTED && !printed) {
            Serial.print("[STA] Connected, IP: ");
            Serial.println(WiFi.localIP());
            printed = true;
        }
    }
}

// -------- URL printing helpers  --------
void EasyWebRemoteControl::printUrlsIfChanged(bool forceOnce) //Prints the access addresses only when the IP has changed, to avoid flooding the console. The parameter forces a single print at startup.
{
    IPAddress ap = WiFi.softAPIP();
    IPAddress st = WiFi.localIP();
    bool apValid = (ap[0] != 0 || ap[1] != 0 || ap[2] != 0 || ap[3] != 0);
    bool stValid = (st[0] != 0 || st[1] != 0 || st[2] != 0 || st[3] != 0);
    if (forceOnce || (apValid && ap != lastApIPPrinted)) {
        lastApIPPrinted = ap;
        Serial.println("[URL] AP:");
        printAddrLine("  HTTP", ap);
        printAddrLine("  WS  ", ap);
    }
    if (forceOnce || (stValid && st != lastStaIPPrinted)) {
        lastStaIPPrinted = st;
        Serial.println("[URL] STA:");
        printAddrLine("  HTTP", st);
        printAddrLine("  WS  ", st);
        if (hostName.length()) {
            Serial.print("  Hostname: http://");
            Serial.print(hostName);
            Serial.println("/");
        }
    }
}

void EasyWebRemoteControl::printAddrLine(const char* label, const IPAddress& ip) //Formats and prints one address line. Skips null addresses.
{
    if (ip[0] == 0 && ip[1] == 0 && ip[2] == 0 && ip[3] == 0) return;
    Serial.print(label);
    Serial.print(": http://");
    Serial.print(ip);
    Serial.println("/");
}

// -------- Auto-recovery internals  --------
void EasyWebRemoteControl::initWatchdogIfNeeded() //Starts the software watchdog. First tries to subscribe the current task to an already-running watchdog; if none exists, initializes one with an 8-second threshold. Conditional compilation covers ESP-IDF v4 and v5, whose APIs differ.
{
#ifdef ESP32
    if (wdtInited) return;
    esp_err_t err;
    err = esp_task_wdt_add(NULL);
    if (err == ESP_OK) {
        wdtInited = true;
    }
    else {
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
        esp_task_wdt_config_t cfg = {};
        cfg.timeout_ms = 8000;
        cfg.idle_core_mask = 0;
        cfg.trigger_panic = true;
        if (esp_task_wdt_init(&cfg) == ESP_OK) {
            if (esp_task_wdt_add(NULL) == ESP_OK) {
                wdtInited = true;
            }
        }
#else
        if (esp_task_wdt_init(8, true) == ESP_OK) {
            if (esp_task_wdt_add(NULL) == ESP_OK) {
                wdtInited = true;
            }
        }
#endif
    }
    if (wdtInited && WiFi.status() == WL_CONNECTED) {
        lastStaSeenConnectedMs = millis();
    }
#endif
}

