BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
void EasyWebRemoteControl::serviceWatchdog() //Feeds the watchdog. If it is not called for 8 seconds, the board reboots automatically.
{
#ifdef ESP32
    if (wdtInited) esp_task_wdt_reset();
#endif
}

void EasyWebRemoteControl::checkAndRecoverWiFi() //The four-state reconnection state machine. Checks the connection at intervals, records the moment it was lost, attempts reconnection after the grace period, and reboots the board if the disconnection exceeds the configured threshold.
{
    const unsigned long now = millis();
    if (now - lastWifiCheckMs < ar_checkIntervalMs) return;
    lastWifiCheckMs = now;
    if (!autoRecoveryEnabled) return;
    if (WiFi.getMode() & WIFI_MODE_STA) {
        wl_status_t s = WiFi.status();
        if (s == WL_CONNECTED) {
            if (staDisconnectSinceMs != 0 || lastStaSeenConnectedMs == 0) {
                Serial.println("[STA] Reconnected successfully.");
                printUrlsIfChanged(true);
            }
            lastStaSeenConnectedMs = now;
            staDisconnectSinceMs = 0;
            return;
        }
        if (staDisconnectSinceMs == 0) {
            staDisconnectSinceMs = now;
            Serial.println("[STA] Lost connection, trying to recover...");
        }
        const unsigned long disconnectedFor = now - staDisconnectSinceMs;
        if (ar_rebootAfterMs > 0 && disconnectedFor >= (unsigned long)ar_rebootAfterMs) {
            Serial.println("[STA] Disconnected too long; rebooting for recovery...");
            ESP.restart();
            return;
        }
        if (ar_reconnectWindowMs == 0) return;
        if (ar_reconnectWindowMs > 0 &&
            disconnectedFor > (unsigned long)ar_reconnectWindowMs) {
            return;
        }
        if (disconnectedFor < ar_reconnectAfterMs) return;
        if (now - lastReconnectAttemptMs >= ar_reconnectPeriodMs) {
            lastReconnectAttemptMs = now;
            Serial.println("[STA] Attempting auto-reconnect...");
            WiFi.reconnect();
        }
    }
}

// -------- public API: callbacks  --------
void EasyWebRemoteControl::onFront(void (*func)()) { frontCallback = func; } //Registers the function called for the matching command. Only stores the pointer; the call happens later, when the command arrives.
void EasyWebRemoteControl::onBack(void (*func)()) { backCallback = func; } //Registers the function called for the matching command. Only stores the pointer; the call happens later, when the command arrives.
void EasyWebRemoteControl::onLeft(void (*func)()) { leftCallback = func; } //Registers the function called for the matching command. Only stores the pointer; the call happens later, when the command arrives.
void EasyWebRemoteControl::onRight(void (*func)()) { rightCallback = func; } //Registers the function called for the matching command. Only stores the pointer; the call happens later, when the command arrives.
void EasyWebRemoteControl::onStop(void (*func)()) { stopCallback = func; } //Registers the function called for the matching command. Only stores the pointer; the call happens later, when the command arrives.

// ====================================================================
// ============  generic command callbacks  ================
// ====================================================================
void EasyWebRemoteControl::onCommand(const char* command, void (*func)()) //Registers a handler for a custom command, identified by name.
{
    if (!command) return;
    commandCallbacks[String(command)] = func;
}
void EasyWebRemoteControl::onAnyCommand(void (*func)(const String&)) //Registers the catch-all handler, called for any command without a dedicated one.
{
    anyCommandCallback = func;
}

// -------- PWM API  --------
int  EasyWebRemoteControl::getPWM() { return currentPWM; }
void EasyWebRemoteControl::setInitialPWM(int val) {
    if (val < sliderMin) val = sliderMin;
    if (val > sliderMax) val = sliderMax;
    currentPWM = val;
}
void EasyWebRemoteControl::showSlider(bool enable) { sliderEnabled = enable; }
void EasyWebRemoteControl::setSliderRange(int minVal, int maxVal) {
    if (maxVal <= minVal) return;          // guard against invalid range
    sliderMin = minVal; sliderMax = maxVal;
    if (currentPWM < sliderMin) currentPWM = sliderMin;
    if (currentPWM > sliderMax) currentPWM = sliderMax;
}
void EasyWebRemoteControl::setSliderLabel(const char* label) { if (label) sliderLabel = label; }
void EasyWebRemoteControl::setSliderWidth(int px) { if (px > 0) sliderWidth = px; }

// -------- video controls  --------
void EasyWebRemoteControl::enableVideo(bool enable) { videoEnabled = enable; }
void EasyWebRemoteControl::setSnapshotFPS(uint8_t fps) { snapshotFPS = fps; }
void EasyWebRemoteControl::pauseSnapshots(bool paused) { videoPaused = paused; }
void EasyWebRemoteControl::setVideoFrameProvider(VideoProvider p) { frameProvider = p; } //Registers the function the library requests frames from. Without it, the video endpoint reports no content.

// -------- per-button behavior  --------
void EasyWebRemoteControl::addActionTimer(const char* buttonId, int durationMs) {
    if (durationMs < -1) return;
    actionTimers[String(buttonId)] = durationMs;
}
void EasyWebRemoteControl::setTaps(const char* buttonId, int tapsRequired) {
    if (tapsRequired < 0) return;
    tapSettings[String(buttonId)] = tapsRequired;
}
void EasyWebRemoteControl::setHold(const char* buttonId, int holdMs) {
    if (holdMs < 0) return;
    holdSettings[String(buttonId)] = holdMs;
}
void EasyWebRemoteControl::setDelay(const char* buttonId, int delayMs) {
    if (delayMs < 0) return;
    delaySettings[String(buttonId)] = delayMs;
}

// ====================================================================
// ============  UI model management  =====================
// ====================================================================
EasyWebRemoteControl::UIButton* EasyWebRemoteControl::findButton(const char* id) //Looks up a button by identifier and returns its address, or null if absent. Used by every styling method.
{
    if (!id) return nullptr;
    String target(id);
    for (auto& b : uiButtons) {
        if (b.id == target) return &b;
    }
    return nullptr;
}

void EasyWebRemoteControl::addButton(const char* id, const char* label, const char* command, int row) //Adds a new button, or updates it if the identifier already exists. The default command equals the identifier. Automatically detects the stop button by id or command so it receives the handler that cancels every timer. Marks that the user has taken control, so the default buttons are no longer injected.
{
    if (!id) return;
    // If a button with this id already exists, update it instead of duplicating.
    UIButton* existing = findButton(id);
    if (existing) {
        if (label)   existing->label = label;
        if (command) existing->command = command;
        existing->row = row;
        return;
    }
    UIButton b;
    b.id = id;
    b.label = label ? label : "";
    b.command = command ? command : id;   // default command == id
    b.row = row;
    // Auto-detect the stop button: if its id or command is "stop", it must use
    // the client-side "stop everything" handler (cancels all timers). This keeps
    // the critical safety behavior intact even when the user builds the UI manually.
    if (b.id == "stop" || b.command == "stop") b.isStop = true;
    uiButtons.push_back(b);
    defaultsInjected = true; // user is taking control; do not inject defaults later
}

