BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
void EasyWebRemoteControl::clearButtons() //Removes all buttons. An explicitly empty interface is a user choice, so the defaults are not re-injected.
{
    uiButtons.clear();
    defaultsInjected = true; // explicit empty UI is a user choice
}

void EasyWebRemoteControl::removeButton(const char* id) //Removes a single button by identifier.
{
    if (!id) return;
    String target(id);
    for (size_t i = 0; i < uiButtons.size(); ++i) {
        if (uiButtons[i].id == target) {
            uiButtons.erase(uiButtons.begin() + i);
            return;
        }
    }
}

// --- Per-button styling ---
void EasyWebRemoteControl::setButtonLabel(const char* id, const char* label) {
    UIButton* b = findButton(id); if (b && label) b->label = label;
}
void EasyWebRemoteControl::setButtonCommand(const char* id, const char* command) {
    UIButton* b = findButton(id); if (b && command) b->command = command;
}
void EasyWebRemoteControl::setButtonRow(const char* id, int row) {
    UIButton* b = findButton(id); if (b) b->row = row;
}
void EasyWebRemoteControl::setButtonColor(const char* id, const char* bgColor, const char* pressedColor) {
    UIButton* b = findButton(id);
    if (!b) return;
    if (bgColor)      b->bgColor = bgColor;
    if (pressedColor) b->pressedColor = pressedColor;
}
void EasyWebRemoteControl::setButtonHoverColor(const char* id, const char* hoverColor) {
    UIButton* b = findButton(id); if (b && hoverColor) b->hoverColor = hoverColor;
}
void EasyWebRemoteControl::setButtonTextColor(const char* id, const char* textColor) {
    UIButton* b = findButton(id); if (b && textColor) b->textColor = textColor;
}
void EasyWebRemoteControl::setButtonSize(const char* id, int width, int height) {
    UIButton* b = findButton(id);
    if (!b) return;
    if (width > 0) b->width = width;
    if (height > 0) b->height = height;
}
void EasyWebRemoteControl::setButtonFontSize(const char* id, int fontSize) {
    UIButton* b = findButton(id); if (b && fontSize > 0) b->fontSize = fontSize;
}
void EasyWebRemoteControl::setButtonBorderRadius(const char* id, const char* radius) {
    UIButton* b = findButton(id); if (b && radius) b->borderRadius = radius;
}
void EasyWebRemoteControl::setStopButton(const char* id, bool isStop) {
    UIButton* b = findButton(id); if (b) b->isStop = isStop;
}

// --- Global styling ---
void EasyWebRemoteControl::setPageTitle(const char* title) { if (title) pageTitle = title; }
void EasyWebRemoteControl::setBackgroundColor(const char* color) { if (color) backgroundColor = color; }
void EasyWebRemoteControl::setFontFamily(const char* family) { if (family) fontFamily = family; }
void EasyWebRemoteControl::setDefaultButtonColor(const char* bgColor, const char* pressedColor) {
    if (bgColor)      defBtnColor = bgColor;
    if (pressedColor) defBtnPressed = pressedColor;
}
void EasyWebRemoteControl::setDefaultButtonSize(int width, int height) {
    if (width > 0) defBtnWidth = width;
    if (height > 0) defBtnHeight = height;
}
void EasyWebRemoteControl::setDefaultFontSize(int fontSize) { if (fontSize > 0) defFontSize = fontSize; }
void EasyWebRemoteControl::setDefaultTextColor(const char* color) { if (color) defTextColor = color; }
void EasyWebRemoteControl::setCustomCSS(const char* css) { if (css) customCSS = css; }
void EasyWebRemoteControl::setHeaderHTML(const char* html) { if (html) headerHTML = html; }
void EasyWebRemoteControl::setFooterHTML(const char* html) { if (html) footerHTML = html; }

// ====================================================================
// ============ escaping helpers  ========================
// ====================================================================
// Escapes a string so it is safe to embed inside a double-quoted JS string.
String EasyWebRemoteControl::jsEscape(const String& s) //Converts dangerous characters into a form that is safe inside a JavaScript context. Also converts the less-than and greater-than signs, so user text cannot close the script tag prematurely.
{
    String out;
    out.reserve(s.length() + 8);
    for (size_t i = 0; i < s.length(); ++i) {
        char c = s[i];
        switch (c) {
        case '\\': out += "\\\\"; break;
        case '"':  out += "\\\""; break;
        case '\'': out += "\\'";  break;
        case '\n': out += "\\n";  break;
        case '\r': out += "\\r";  break;
        case '<':  out += "\\u003C"; break; // prevent </script> breakouts
        case '>':  out += "\\u003E"; break;
        default:   out += c;       break;
        }
    }
    return out;
}

// Escapes a string so it is safe to embed inside HTML text/attributes.
String EasyWebRemoteControl::htmlEscape(const String& s) //Converts special characters into HTML entities. Applied to labels and attributes, it prevents code injection through user-supplied text.
{
    String out;
    out.reserve(s.length() + 8);
    for (size_t i = 0; i < s.length(); ++i) {
        char c = s[i];
        switch (c) {
        case '&':  out += "&amp;";  break;
        case '<':  out += "&lt;";   break;
        case '>':  out += "&gt;";   break;
        case '"':  out += "&quot;"; break;
        case '\'': out += "&#39;";  break;
        default:   out += c;        break;
        }
    }
    return out;
}

// Injects the classic 5-button layout if the user never added any button.
// This guarantees byte-for-byte identical behavior to the legacy version
// for anyone who does not touch the new UI API.
void EasyWebRemoteControl::ensureDefaultButtons() //Injects the classic five-button layout when the user has added none. This is the backward-compatibility guarantee: anyone who does not touch the new API gets exactly the old interface.
{
    if (defaultsInjected || !uiButtons.empty()) return;

    UIButton front; front.id = "front"; front.label = "\xE2\x86\x91"; front.command = "front"; front.row = 0;
    UIButton left;  left.id = "left";  left.label = "\xE2\x86\x90"; left.command = "left";  left.row = 1;
    UIButton stop;  stop.id = "stop";  stop.label = "\xE2\x96\xA0"; stop.command = "stop";  stop.row = 1; stop.isStop = true;
    UIButton right; right.id = "right"; right.label = "\xE2\x86\x92"; right.command = "right"; right.row = 1;
    UIButton back;  back.id = "back";  back.label = "\xE2\x86\x93"; back.command = "back";  back.row = 2;

    uiButtons.push_back(front);
    uiButtons.push_back(left);
    uiButtons.push_back(stop);
    uiButtons.push_back(right);
    uiButtons.push_back(back);

    defaultsInjected = true;
}

// -------- command handling  --------
void EasyWebRemoteControl::handleCommand(String cmd) //Normalizes the command, rejects empty or oversized messages, handles the slider command separately with range clamping, then dispatches on three levels: the classic commands with highest priority, custom handlers, and finally the catch-all handler. An unknown command with no handler is silently ignored.
{
    cmd.trim();
    if (cmd.length() == 0) return;
    // reject oversized commands (anti-DoS / anti buffer abuse).
    if (cmd.length() > maxCommandLength) return;

