BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
    if (cmd.startsWith("pwm:")) {
        int v = cmd.substring(4).toInt();
        if (v < sliderMin) v = sliderMin;
        if (v > sliderMax) v = sliderMax;
        currentPWM = v;
        return;
    }

    // (1) Classic fixed dispatch — preserved exactly, highest priority.
    if (cmd == "front" && frontCallback) { frontCallback(); return; }
    else if (cmd == "back" && backCallback) { backCallback();  return; }
    else if (cmd == "left" && leftCallback) { leftCallback();  return; }
    else if (cmd == "right" && rightCallback) { rightCallback(); return; }
    else if (cmd == "stop" && stopCallback) { stopCallback();  return; }

    // (2) per-command custom handlers registered via onCommand().
    auto it = commandCallbacks.find(cmd);
    if (it != commandCallbacks.end() && it->second) {
        it->second();
        return;
    }

    // (3)  catch-all handler registered via onAnyCommand().
    if (anyCommandCallback) {
        anyCommandCallback(cmd);
        return;
    }
    // Unknown command with no handler: silently ignored.
}

// -------- websocket (token auth + rate limiting) --------
void EasyWebRemoteControl::onWsEvent(AsyncWebSocket* server, AsyncWebSocketClient* client,
    AwsEventType type, void* arg, uint8_t* data, size_t len) //The gate every command passes through. On disconnect and on connect it clears all state tied to that client, so a new client cannot inherit an old one's authentication. Limits the raw message size, then checks in order: token authentication with constant-time comparison, session expiry, rate limiting, and decryption. An unauthenticated client receives an explicit re-authentication request instead of having its message dropped without explanation.
{
    (void)server; (void)arg; // required by AsyncWebSocket signature, not used here
    if (!instance) return;

    const uint32_t cid = client ? client->id() : 0;

    if (type == WS_EVT_DISCONNECT) {
        // Clean up per-client security state to avoid leaks.
        instance->authedClients.erase(cid);
        instance->rateMap.erase(cid);
        instance->lastSeenMs.erase(cid);
        return;
    }

    if (type == WS_EVT_CONNECT) {
 
        instance->authedClients.erase(cid);
        instance->lastSeenMs.erase(cid);
        instance->rateMap.erase(cid);
        return;
    }

    if (type == WS_EVT_DATA) {
        String msg;
        msg.reserve(len);
        for (size_t i = 0; i < len; ++i) msg += (char)data[i];
        msg.trim();


        const size_t rawLimit = (size_t)instance->maxCommandLength * 4 + 64;
        if (msg.length() > rawLimit) return;

        const uint32_t now = millis();

        // ---- Authentication gate ----
        if (instance->authEnabled) {
            if (!instance->wsClientAuthed(cid)) {
                // Only accept an "auth:<token>" message until authenticated.
                if (msg.startsWith("auth:")) {
                    String tok = msg.substring(5);
                    //constant-time comparison (anti timing-attack).
                    if (instance->wsToken.length() && instance->secureEquals(tok, instance->wsToken)) {
                        instance->authedClients.insert(cid);
                        instance->lastSeenMs[cid] = now;
                        instance->fireSecurityEvent(SEC_LOGIN_OK, String("ws token ok (client #") + String(cid) + ")");
                        if (client) client->text("auth:ok");
                    }
                    else {
                        instance->fireSecurityEvent(SEC_BAD_TOKEN, String("ws token bad (client #") + String(cid) + ")");
                        if (client) client->text("auth:fail");
                        if (client) client->close();
                    }
                }
                else {

                    if (client) client->text("auth:required");
                }
                return;
            }

            // session expiry — invalidate idle sessions.
            if (instance->sessionTimeoutMs > 0) {
                uint32_t last = instance->lastSeenMs.count(cid) ? instance->lastSeenMs[cid] : now;
                if (now - last > instance->sessionTimeoutMs) {
                    instance->authedClients.erase(cid);
                    instance->lastSeenMs.erase(cid);
                    if (client) { client->text("auth:expired"); client->close(); }
                    return;
                }
            }
            instance->lastSeenMs[cid] = now;
        }

        // ---- Rate limiting ----
        if (instance->rateLimited(cid)) {
            instance->fireSecurityEvent(SEC_RATE_LIMIT, "rate limit");
            return;
        }

        // ---- decryption of encrypted commands ----
        // Encrypted commands arrive as "enc:<base64>". In strict mode (default)
        // plaintext control commands are rejected so nothing leaks in the clear.
        // With setEncryptionFallback(true), plaintext is accepted as a documented
        // degradation for browsers without a secure context (the page shows a
        // visible warning in that case).
        if (instance->encryptionEnabled) {
            if (msg.startsWith("enc:")) {
                String plain = instance->tryDecryptCommand(msg.substring(4));
                if (plain.length() == 0) return;   // decryption failed (event already fired)
                instance->handleCommand(plain);
                return;
            }
            if (!instance->encryptionFallback) {
                // Strict: never accept plaintext while encryption is on.
                return;
            }
            // Fallback: fall through and accept the plaintext command.
        }

        instance->handleCommand(msg);
    }
}
// ====================================================================
// ============  security implementation  =================
// ====================================================================

// ---- public configuration ----
void EasyWebRemoteControl::setAuthCredentials(const char* username, const char* password) {
    if (!username || !password) return;
    authUser = username;
    authPass = password;
    authEnabled = true;
}
void EasyWebRemoteControl::clearAuthCredentials() {
    authEnabled = false; authUser = ""; authPass = "";
}
void EasyWebRemoteControl::setUseDigestAuth(bool useDigest) { useDigestAuth = useDigest; }
void EasyWebRemoteControl::setAuthRealm(const char* realm) { if (realm) authRealm = realm; }
void EasyWebRemoteControl::requireAuthForSnapshot(bool require) { protectSnapshot = require; }
void EasyWebRemoteControl::setAuthToken(const char* token) {
    if (!token) return;
    wsToken = token; wsTokenSet = true;
}
void EasyWebRemoteControl::setRateLimit(uint16_t maxCommandsPerSec) { rateLimitPerSec = maxCommandsPerSec; }
void EasyWebRemoteControl::setMaxCommandLength(uint16_t maxLen) { if (maxLen > 0) maxCommandLength = maxLen; }
void EasyWebRemoteControl::setMaxAuthAttempts(uint8_t maxAttempts, uint32_t lockoutMs) {
    maxAuthAttempts = maxAttempts; authLockoutMs = lockoutMs;
}
void EasyWebRemoteControl::setTLSCertificate(const char* certPem, const char* keyPem) {
    if (!certPem || !keyPem) return;
    tlsCert = certPem; tlsKey = keyPem; tlsEnabled = true;
}

// ---- token generation (cryptographically-seeded on ESP32) ----
String EasyWebRemoteControl::genToken() //Generates a 128-bit token using the board's hardware random number generator. Each byte becomes two hexadecimal characters. Unlike the ordinary pseudo-random generator, the seed is not predictable.
{
    // 32 hex chars = 128 bits of entropy from the hardware RNG.
    const char* hex = "0123456789abcdef";
    String t;
    t.reserve(32);
    for (int i = 0; i < 16; ++i) {
#ifdef ESP32
        uint8_t b = (uint8_t)(esp_random() & 0xFF);
#else
        uint8_t b = (uint8_t)(rand() & 0xFF);
#endif
        t += hex[(b >> 4) & 0x0F];
        t += hex[b & 0x0F];
    }
    return t;
}

// ---- HTTP auth check with brute-force lockout ----
bool EasyWebRemoteControl::httpAuthOK(AsyncWebServerRequest* req) //Verifies authentication for an HTTP request. Packs the client address into an integer for efficient tracking, applies the lockout before comparing the password, resets the counter on a successful login, and on failure increments it and locks out once the threshold is reached. Bounds the failure map so it cannot grow indefinitely.
{
    if (!authEnabled) return true;

    // Identify the client IP for brute-force tracking.
    uint32_t ipKey = 0;
    IPAddress rip = req->client()->remoteIP();
    ipKey = ((uint32_t)rip[0]) | ((uint32_t)rip[1] << 8) |
        ((uint32_t)rip[2] << 16) | ((uint32_t)rip[3] << 24);

