BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
    const uint32_t now = millis();

    // Enforce lockout if brute-force protection is enabled.
    if (maxAuthAttempts > 0) {
        auto it = authFailMap.find(ipKey);
        if (it != authFailMap.end() && it->second.lockedUntilMs != 0) {
            if (now < it->second.lockedUntilMs) {
                fireSecurityEvent(SEC_AUTH_LOCKOUT, "ip locked out");
                req->send(429, "text/plain", "Too many attempts. Try again later.");
                return false;
            }
            else {
                // Lockout expired; reset.
                it->second.failures = 0;
                it->second.lockedUntilMs = 0;
            }
        }
    }

    // Validate credentials (Basic or Digest handled by the server library).
    bool ok = req->authenticate(authUser.c_str(), authPass.c_str());
    if (ok) {
        if (maxAuthAttempts > 0) authFailMap.erase(ipKey);
        fireSecurityEvent(SEC_LOGIN_OK, "http login ok");
        return true;
    }

    // Failed: record attempt and possibly lock out.
    fireSecurityEvent(SEC_AUTH_FAIL, "http login fail");
    if (maxAuthAttempts > 0) {
        
        if (authFailMap.size() >= 64 && authFailMap.find(ipKey) == authFailMap.end()) {
            authFailMap.clear();
        }
        AuthFailInfo& info = authFailMap[ipKey];
        info.failures++;
        if (info.failures >= maxAuthAttempts) {
            info.lockedUntilMs = now + authLockoutMs;
            fireSecurityEvent(SEC_AUTH_LOCKOUT, "ip locked out");
            Serial.println("[SEC] IP locked out after repeated auth failures.");
        }
    }
    // Ask the browser to authenticate (shows the login dialog).
    req->requestAuthentication(authRealm.c_str());
    return false;
}

bool EasyWebRemoteControl::wsClientAuthed(uint32_t clientId) //Checks whether a WebSocket connection has passed token authentication.
{
    return authedClients.find(clientId) != authedClients.end();
}

// ---- per-client rate limiting (sliding 1-second window) ----
bool EasyWebRemoteControl::rateLimited(uint32_t clientId) //Rate limiting with a one-second sliding window, counted separately for each client, so an abusive client does not affect the others.
{
    if (rateLimitPerSec == 0) return false; // disabled
    const uint32_t now = millis();
    RateInfo& r = rateMap[clientId];
    if (now - r.windowStartMs >= 1000) {
        r.windowStartMs = now;
        r.count = 0;
    }
    r.count++;
    return (r.count > rateLimitPerSec);
}

// ====================================================================
// ============  hardening + encryption impl  =============
// ====================================================================

// ---- public configuration ----
void EasyWebRemoteControl::setSessionTimeout(uint32_t ms) { sessionTimeoutMs = ms; }
void EasyWebRemoteControl::setRotateTokenPerLoad(bool rotate) { rotateTokenPerLoad = rotate; }
void EasyWebRemoteControl::setSecurityHeaders(bool enable) { securityHeaders = enable; }

void EasyWebRemoteControl::allowIP(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
    uint32_t k = ((uint32_t)a) | ((uint32_t)b << 8) | ((uint32_t)c << 16) | ((uint32_t)d << 24);
    allowedIPs.insert(k);
}
void EasyWebRemoteControl::blockIP(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
    uint32_t k = ((uint32_t)a) | ((uint32_t)b << 8) | ((uint32_t)c << 16) | ((uint32_t)d << 24);
    blockedIPs.insert(k);
}
void EasyWebRemoteControl::clearIPFilters() { allowedIPs.clear(); blockedIPs.clear(); }

void EasyWebRemoteControl::onSecurityEvent(void (*cb)(SecurityEvent, const String&)) {
    securityEventCb = cb;
}

void EasyWebRemoteControl::setEncryptionKey(const char* passphrase) {
    if (!passphrase) return;
    encryptionPass = passphrase;
    encryptionEnabled = true;
}
void EasyWebRemoteControl::setEncryptionFallback(bool allowPlaintext) {
    encryptionFallback = allowPlaintext;
}
void EasyWebRemoteControl::clearEncryptionKey() {
    encryptionEnabled = false; encryptionPass = "";
}

// ---- constant-time string comparison (anti timing-attack) ----
// Compares in time proportional to the longer input, independent of where the
// first difference occurs, so an attacker cannot learn the secret byte by byte.
bool EasyWebRemoteControl::secureEquals(const String& a, const String& b) {
    const size_t la = a.length(), lb = b.length();
    const size_t n = (la > lb) ? la : lb;
    uint8_t diff = (uint8_t)(la ^ lb);   // length mismatch also contributes
    for (size_t i = 0; i < n; ++i) {
        uint8_t ca = (i < la) ? (uint8_t)a[i] : 0;
        uint8_t cb = (i < lb) ? (uint8_t)b[i] : 0;
        diff |= (uint8_t)(ca ^ cb);
    }
    return diff == 0;
}

uint32_t EasyWebRemoteControl::ipKeyOf(AsyncWebServerRequest* req) {
    IPAddress rip = req->client()->remoteIP();
    return ((uint32_t)rip[0]) | ((uint32_t)rip[1] << 8) |
        ((uint32_t)rip[2] << 16) | ((uint32_t)rip[3] << 24);
}

bool EasyWebRemoteControl::ipAllowed(uint32_t ipKey) {
    // Blocklist always wins.
    if (blockedIPs.find(ipKey) != blockedIPs.end()) return false;
    // If an allowlist exists, the IP must be in it.
    if (!allowedIPs.empty() && allowedIPs.find(ipKey) == allowedIPs.end()) return false;
    return true;
}

bool EasyWebRemoteControl::ipFilterOK(AsyncWebServerRequest* req) {
    if (allowedIPs.empty() && blockedIPs.empty()) return true;
    uint32_t k = ipKeyOf(req);
    if (!ipAllowed(k)) {
        fireSecurityEvent(SEC_IP_BLOCKED, "IP not permitted");
        req->send(403, "text/plain", "Forbidden");
        return false;
    }
    return true;
}

void EasyWebRemoteControl::fireSecurityEvent(SecurityEvent ev, const String& detail) {
    if (securityEventCb) securityEventCb(ev, detail);
}

void EasyWebRemoteControl::addSecurityHeaders(AsyncWebServerResponse* resp) {
    if (!resp) return;
    if (!(securityHeaders || authEnabled)) return;
    // A conservative, self-contained policy. 'unsafe-inline' is required because
    // the UI ships inline CSS/JS generated on-device; everything else is locked.
    resp->addHeader("Content-Security-Policy",
        "default-src 'self'; script-src 'self' 'unsafe-inline'; "
        "style-src 'self' 'unsafe-inline'; img-src 'self' data:; "
        "connect-src 'self' ws: wss:; frame-ancestors 'none'; base-uri 'none'");
    resp->addHeader("X-Frame-Options", "DENY");
    resp->addHeader("X-Content-Type-Options", "nosniff");
    resp->addHeader("Referrer-Policy", "no-referrer");
    resp->addHeader("Permissions-Policy", "geolocation=(), microphone=(), camera=()");
    if (tlsEnabled) {
        resp->addHeader("Strict-Transport-Security", "max-age=31536000");
    }
}

// ---- AES-256-GCM decryption via mbedTLS ----
// Input: base64 of [12-byte IV][ciphertext][16-byte tag].
// Key: PBKDF2-HMAC-SHA256(passphrase, salt, 100000, 32 bytes).
// Returns the decrypted command, or an empty string on any failure.
String EasyWebRemoteControl::tryDecryptCommand(const String& encB64) {
#ifdef ESP32
    if (!encryptionEnabled || encryptionPass.length() == 0) return String("");

    // 1) base64-decode the payload.
    const size_t inLen = encB64.length();
    size_t rawLen = 0;
    // First call to get required size.
    unsigned char* raw = (unsigned char*)malloc(inLen); // decoded <= input length
    if (!raw) return String("");
    int rc = mbedtls_base64_decode(raw, inLen, &rawLen,
        (const unsigned char*)encB64.c_str(), inLen);
    if (rc != 0 || rawLen < (12 + 16 + 1)) { free(raw); fireSecurityEvent(SEC_DECRYPT_FAIL, "b64"); return String(""); }

    const unsigned char* iv = raw;                 // 12 bytes
    const unsigned char* ct = raw + 12;            // ciphertext
    const size_t ctLen = rawLen - 12 - 16;    // minus IV and tag
    const unsigned char* tag = raw + 12 + ctLen;    // 16 bytes

    // 2) derive the 256-bit key with PBKDF2-HMAC-SHA256.
    unsigned char key[32];
    const mbedtls_md_info_t* mdinfo = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
    if (!mdinfo) { free(raw); return String(""); }
#if defined(MBEDTLS_VERSION_NUMBER) && (MBEDTLS_VERSION_NUMBER >= 0x03000000)
    // mbedTLS 3.x (ESP-IDF v5+)
    rc = mbedtls_pkcs5_pbkdf2_hmac_ext(MBEDTLS_MD_SHA256,
        (const unsigned char*)encryptionPass.c_str(), encryptionPass.length(),
        (const unsigned char*)pbkdfSalt.c_str(), pbkdfSalt.length(),
        100000, sizeof(key), key);
#else
    // mbedTLS 2.x (ESP-IDF v4)
    mbedtls_md_context_t md_ctx;
    mbedtls_md_init(&md_ctx);
    rc = mbedtls_md_setup(&md_ctx, mdinfo, 1);   // 1 = HMAC
    if (rc == 0) {
        rc = mbedtls_pkcs5_pbkdf2_hmac(&md_ctx,
            (const unsigned char*)encryptionPass.c_str(), encryptionPass.length(),
            (const unsigned char*)pbkdfSalt.c_str(), pbkdfSalt.length(),
            100000, sizeof(key), key);
    }
    mbedtls_md_free(&md_ctx);
#endif
    if (rc != 0) { free(raw); fireSecurityEvent(SEC_DECRYPT_FAIL, "pbkdf2"); return String(""); }

    // 3) AES-256-GCM authenticated decryption.
    unsigned char* out = (unsigned char*)malloc(ctLen + 1);
    if (!out) { free(raw); return String(""); }
    mbedtls_gcm_context gcm;
    mbedtls_gcm_init(&gcm);
    rc = mbedtls_gcm_setkey(&gcm, MBEDTLS_CIPHER_ID_AES, key, 256);
    if (rc == 0) {
        rc = mbedtls_gcm_auth_decrypt(&gcm, ctLen,
            iv, 12, nullptr, 0, tag, 16, ct, out);
    }
    mbedtls_gcm_free(&gcm);
    free(raw);

    if (rc != 0) { free(out); fireSecurityEvent(SEC_DECRYPT_FAIL, "gcm"); return String(""); }
    out[ctLen] = 0;
    String result = String((const char*)out);
    free(out);
    return result;
#else
    (void)encB64;
    return String("");
#endif
}

