BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
// ====================================================================
// ============  data-driven page builder  ================
// ====================================================================
// This rewrite generates the UI from the uiButtons vector instead of
// hardcoded HTML. If the user never configured anything, ensureDefaultButtons()
// injects the classic 5-button layout, so the output is functionally identical
// to the legacy version. The embedded JavaScript behavior engine (taps / hold /
// delay / action timers / stop-all) is preserved verbatim — only the button
// list it operates on is now generated dynamically.

String EasyWebRemoteControl::buildHtmlPage() {
    // Make sure we have something to render (classic defaults if untouched).
    ensureDefaultButtons();

    // ---- Serialize behavior configuration maps to JS objects ----
    // (Bug fixed vs legacy: each map now uses its OWN length, not timersJS's.)
    String timersJS = "const actionTimers={";
    for (auto& kv : actionTimers) { timersJS += "\"" + jsEscape(kv.first) + "\":" + String(kv.second) + ","; }
    if (!actionTimers.empty()) timersJS.remove(timersJS.length() - 1);
    timersJS += "};";

    String tapsJS = "const tapConfig={";
    for (auto& kv : tapSettings) { tapsJS += "\"" + jsEscape(kv.first) + "\":" + String(kv.second) + ","; }
    if (!tapSettings.empty()) tapsJS.remove(tapsJS.length() - 1);
    tapsJS += "};";

    String holdJS = "const holdConfig={";
    for (auto& kv : holdSettings) { holdJS += "\"" + jsEscape(kv.first) + "\":" + String(kv.second) + ","; }
    if (!holdSettings.empty()) holdJS.remove(holdJS.length() - 1);
    holdJS += "};";

    String delayJS = "const delayConfig={";
    for (auto& kv : delaySettings) { delayJS += "\"" + jsEscape(kv.first) + "\":" + String(kv.second) + ","; }
    if (!delaySettings.empty()) delayJS.remove(delayJS.length() - 1);
    delayJS += "};";

    // ---- Build a JS map: command-per-button-id, plus a list of interactive
    //      (non-stop) buttons and the id(s) flagged as "stop". ----
    String btnCmdJS = "const btnCommands={";
    String interactiveListJS = "const interactiveButtons=[";
    String stopListJS = "const stopButtons=[";
    bool firstCmd = true, firstInteractive = true, firstStop = true;
    for (auto& b : uiButtons) {
        String cmd = b.command.length() ? b.command : b.id;
        if (!firstCmd) btnCmdJS += ",";
        btnCmdJS += "\"" + jsEscape(b.id) + "\":\"" + jsEscape(cmd) + "\"";
        firstCmd = false;

        if (b.isStop) {
            if (!firstStop) stopListJS += ",";
            stopListJS += "\"" + jsEscape(b.id) + "\"";
            firstStop = false;
        }
        else {
            if (!firstInteractive) interactiveListJS += ",";
            interactiveListJS += "\"" + jsEscape(b.id) + "\"";
            firstInteractive = false;
        }
    }
    btnCmdJS += "};";
    interactiveListJS += "];";
    stopListJS += "];";

    // ---- Per-button CSS overrides ----
    // Generate a rule for each button that has at least one custom attribute.
    String perBtnCSS = "";
    for (auto& b : uiButtons) {
        String rule = "";
        if (b.bgColor.length())      rule += "background:" + b.bgColor + ";";
        if (b.textColor.length())    rule += "color:" + b.textColor + ";";
        if (b.width > 0)            rule += "width:" + String(b.width) + "px;";
        if (b.height > 0)            rule += "height:" + String(b.height) + "px;";
        if (b.fontSize > 0)          rule += "font-size:" + String(b.fontSize) + "px;";
        if (b.borderRadius.length()) rule += "border-radius:" + b.borderRadius + ";";
        if (rule.length()) {
            // Use attribute selector on data-id to avoid clashes with HTML id rules.
            perBtnCSS += "button[data-id=\"" + b.id + "\"]{" + rule + "}";
        }
        if (b.pressedColor.length()) {
            perBtnCSS += "button[data-id=\"" + b.id + "\"].pressed{background:" + b.pressedColor + ";}";
        }
        if (b.hoverColor.length()) {
            perBtnCSS += "button[data-id=\"" + b.id + "\"]:hover{background:" + b.hoverColor + ";}";
        }
    }

    // ---- Group buttons by row and emit the HTML ----
    // Find max row to iterate in order.
    int maxRow = 0;
    for (auto& b : uiButtons) if (b.row > maxRow) maxRow = b.row;

    String controlsHTML = "";
    for (int r = 0; r <= maxRow; ++r) {
        String rowHTML = "";
        bool any = false;
        for (auto& b : uiButtons) {
            if (b.row != r) continue;
            any = true;
            // data-id carries the (unescaped-for-HTML-attr) id; htmlEscape keeps it safe.
            rowHTML += "<button data-id=\"" + htmlEscape(b.id) + "\">"
                + htmlEscape(b.label) + "</button>";
        }
        if (any) {
            controlsHTML += "<div class=\"row\">" + rowHTML + "</div>";
        }
    }

    // ---- Slider block ----
    String sliderUI = "";
    if (sliderEnabled) {
        String labelHTML = sliderLabel.length()
            ? "<span class=\"sliderLabel\">" + htmlEscape(sliderLabel) + "</span>" : "";
        sliderUI =
            "<div class=\"row\">"
            + labelHTML +
            "<input type=\"range\" id=\"pwmSlider\" min=\"" + String(sliderMin) +
            "\" max=\"" + String(sliderMax) + "\" value=\"" + String(currentPWM) + "\">"
            "<span id=\"pwmValue\">" + String(currentPWM) + "</span>"
            "</div>";
    }

    // ---- Video block ----
    String videoUI = "";
    if (videoEnabled) {
        videoUI =
            "<div class=\"row\" id=\"videoRow\">"
            "<img id=\"snapImg\" alt=\"\" style=\"max-width:320px;max-height:240px;border-radius:8px;box-shadow:0 1px 4px rgba(0,0,0,.2)\"/>"
            "</div>";
    }

    // ---- Assemble full page ----
    String page =
        "<!DOCTYPE html><html><head><meta charset=\"UTF-8\"><title>" + htmlEscape(pageTitle) + "</title>"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<style>"
        "body{text-align:center;font-family:" + fontFamily + ";background:" + backgroundColor + ";margin:0;padding:12px;-webkit-touch-callout:none;-webkit-user-select:none;-moz-user-select:none;-ms-user-select:none;user-select:none;}"
        "h2{margin:18px 0;font-size:20px;}"
        ".row{margin:14px 0;display:flex;justify-content:center;align-items:center;gap:12px;-webkit-tap-highlight-color:transparent;flex-wrap:wrap;}"
        "button{width:" + String(defBtnWidth) + "px;height:" + String(defBtnHeight) + "px;font-size:" + String(defFontSize) + "px;margin:0;border-radius:12px;cursor:pointer;background:" + defBtnColor + ";color:" + defTextColor + ";border:none;transition:0.18s;}"
        "button.pressed{background:" + defBtnPressed + ";transform:translateY(1px);}"
        "button:hover{background-color:" + defBtnHover + ";}"
        "input[type=range]{width:" + String(sliderWidth) + "px;}#pwmValue{display:inline-block;width:44px;text-align:center;font-size:18px;margin-left:10px;}"
        ".sliderLabel{font-size:16px;margin-right:8px;}"
        "@media(max-width:480px){button{width:80px;height:80px;font-size:28px;}input[type=range]{width:180px;}}"
        + perBtnCSS
        + customCSS +
        "</style></head><body>"
        + headerHTML +
        "<h2>" + htmlEscape(pageTitle) + "</h2><div id=\"controls\">"
        + controlsHTML + sliderUI + videoUI +
        "</div>"
        + footerHTML +
        "<script>" + timersJS + tapsJS + holdJS + delayJS + btnCmdJS + interactiveListJS + stopListJS +
        "const VIDEO_ENABLED=" + String(videoEnabled ? "true" : "false") + ";"
        "const VIDEO_PAUSED=" + String(videoPaused ? "true" : "false") + ";"
        "const SNAP_FPS=" + String(snapshotFPS) + ";"
        // WS auth token — injected ONLY when auth is enabled. Because the
        // page itself is served behind HTTP auth, only authenticated users ever
        // receive this token.
        "const WS_AUTH=" + String(authEnabled ? "true" : "false") + ";"
        "const WS_TOKEN=\"" + (authEnabled ? jsEscape(wsToken) : String("")) + "\";"
        //  encryption constants. WS_ENCRYPT enables AES-256-GCM of commands.
        // The salt is public (PBKDF2 salt); the passphrase is NEVER sent — the
        // user types it into the browser, so plaintext and key never hit the wire.
        "const WS_ENCRYPT=" + String(encryptionEnabled ? "true" : "false") + ";"
        "const ENC_SALT=\"" + (encryptionEnabled ? jsEscape(pbkdfSalt) : String("")) + "\";"
        "const ENC_FALLBACK=" + String(encryptionFallback ? "true" : "false") + ";"
        R"JS(
// Use current origin (works in AP, STA, and Dual), auto-select ws/wss
const gateway = (location.protocol === 'https:' ? 'wss://' : 'ws://') + location.host + '/ws';
let ws;
let wsAuthed = false;
let wsGaveUp = false;   // token respins definitiv: nu mai reconectam

// ----  encryption (AES-256-GCM via Web Crypto) ----
// crypto.subtle exists ONLY in a secure context (HTTPS, localhost, tunnel).
// Over plain http://IP it is undefined, so we detect that and refuse to send,
// telling the user to use TLS/localhost. This is a browser rule, not a bug.
let encKey = null;
const cryptoOK = (typeof crypto !== 'undefined' && crypto.subtle);
async function deriveKey(passphrase, saltHex){
  const enc = new TextEncoder();

