BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
  const salt = enc.encode(saltHex);
  const baseKey = await crypto.subtle.importKey('raw', enc.encode(passphrase),
                    {name:'PBKDF2'}, false, ['deriveKey']);
  return crypto.subtle.deriveKey(
    {name:'PBKDF2', salt, iterations:100000, hash:'SHA-256'},
    baseKey, {name:'AES-GCM', length:256}, false, ['encrypt']);
}
function b64(bytes){ let s=''; bytes.forEach(b=>s+=String.fromCharCode(b)); return btoa(s); }
async function encryptCmd(plain){
  const iv = crypto.getRandomValues(new Uint8Array(12));
  const ctBuf = await crypto.subtle.encrypt({name:'AES-GCM', iv}, encKey,
                    new TextEncoder().encode(plain));
  const ct = new Uint8Array(ctBuf);
  const out = new Uint8Array(iv.length + ct.length);
  out.set(iv, 0); out.set(ct, iv.length);   // [IV][ciphertext+tag]
  return 'enc:' + b64(out);
}
// Afiseaza vizibil starea canalului. Utilizatorul stie mereu daca
// comenzile sunt criptate sau nu — transparenta, nu presupuneri.
let plainMode = false;
function secBadge(text, bg, fg){
  let b = document.getElementById('secBadge');
  if(!b){
    b = document.createElement('div');
    b.id = 'secBadge';
    b.style.cssText = 'margin:10px auto 0;padding:6px 16px;border-radius:20px;'
      + 'display:inline-block;font-size:13px;font-weight:700;letter-spacing:.5px;';
    document.body.insertBefore(b, document.body.firstChild);
  }
  b.textContent = text;
  b.style.background = bg;
  b.style.color = fg;
}

async function initEncryption(){
  if(!WS_ENCRYPT){ console.log('[EWRC] Criptare dezactivata in sketch.'); return; }
  console.log('[EWRC] WS_ENCRYPT=' + WS_ENCRYPT + '  FALLBACK=' + ENC_FALLBACK
            + '  crypto.subtle=' + (typeof crypto !== 'undefined' ? typeof crypto.subtle : 'no crypto')
            + '  secureContext=' + (typeof isSecureContext !== 'undefined' ? isSecureContext : '?'));
  if(!cryptoOK){

    if(ENC_FALLBACK){
      plainMode = true;
      secBadge('CANAL NECRIPTAT - context nesecurizat', '#7a2c2c', '#ffdcdc');
      console.log('Web Crypto indisponibil: comenzi in clar (fallback activat).');
    } else {
      secBadge('BLOCAT - criptarea necesita HTTPS/localhost', '#7a2c2c', '#ffdcdc');
      alert('Criptarea necesita un context securizat (HTTPS sau localhost). '
          + 'Peste http://IP simplu, browserul dezactiveaza Web Crypto.');
    }
    return;
  }
  const pass = prompt('Introduceti fraza de criptare:');
  if(pass){
    encKey = await deriveKey(pass, ENC_SALT);
    secBadge('CANAL CRIPTAT AES-256-GCM', '#14532d', '#c9f7d5');
  } else if(ENC_FALLBACK){
    plainMode = true;
    secBadge('CANAL NECRIPTAT - fara fraza', '#7a2c2c', '#ffdcdc');
  } else {
    secBadge('BLOCAT - fara fraza de criptare', '#7a2c2c', '#ffdcdc');
  }
}

function connectWS(){
  ws = new WebSocket(gateway);
  ws.onopen  = ()=>{
    if (WS_AUTH) { wsAuthed = false; ws.send('auth:' + WS_TOKEN); }
    else { wsAuthed = true; }
  };
  ws.onmessage = (ev)=>{
    if (ev.data === 'auth:ok')      wsAuthed = true;

    if (ev.data === 'auth:required'){
      wsAuthed = false;
      if (WS_AUTH && !wsGaveUp) ws.send('auth:' + WS_TOKEN);
    }

    if (ev.data === 'auth:fail' || ev.data === 'auth:expired'){
      wsAuthed = false;
      wsGaveUp = true;
      secBadge('SESIUNE INVALIDA - reincarca pagina (F5)', '#7a2c2c', '#ffdcdc');
      console.log('[EWRC] Token respins sau sesiune expirata. Reincarca pagina.');
    }
  };
  ws.onclose = ()=>{
    wsAuthed = false;
    if (wsGaveUp) return;            // nu mai insistam cu un token invalid
    setTimeout(connectWS,1000);
  };
  ws.onerror = (e)=>console.log('ws err', e);
}
initEncryption();
connectWS();
async function sendCommand(cmd){
  if(!(ws && ws.readyState===WebSocket.OPEN && (wsAuthed || !WS_AUTH))) return;
  if(WS_ENCRYPT){
    if(encKey){
      // Avem cheie: criptam intotdeauna.
      try { ws.send(await encryptCmd(cmd)); } catch(e){ console.log('enc err', e); }
      return;
    }
    // Fara cheie: trimitem in clar DOAR daca fallback-ul e activat explicit.
    if(!plainMode) return;   // strict: refuzam sa trimitem necriptat
  }
  ws.send(cmd);
}

// Resolve the command string for a button id (falls back to the id itself).
function cmdFor(btnId){ return (btnCommands && btnCommands[btnId]!==undefined) ? btnCommands[btnId] : btnId; }

const pressActive={}; const pressStart={}; const holdTimer={}; const actionActive={};
const startDelayTimer={}; const tapCount={}; const tapResetTimer={}; const pendingStopTimer={};
const TAP_RESET_MS=600;

function clearPendingStop(btnId){if(pendingStopTimer[btnId]){clearTimeout(pendingStopTimer[btnId]); pendingStopTimer[btnId]=null;}}
function clearStartDelay(btnId){if(startDelayTimer[btnId]){clearTimeout(startDelayTimer[btnId]); startDelayTimer[btnId]=null;}}
function clearHoldTimeout(btnId){if(holdTimer[btnId]){clearTimeout(holdTimer[btnId]); holdTimer[btnId]=null;}}
function clearTapReset(btnId){if(tapResetTimer[btnId]){clearTimeout(tapResetTimer[btnId]); tapResetTimer[btnId]=null;}}

function scheduleStopIfNeeded(btnId){
  clearPendingStop(btnId);
  const t = (actionTimers && actionTimers[btnId]!==undefined)?actionTimers[btnId]:0;
  if(t===0){ sendCommand("stop"); actionActive[btnId]=false; }
  else if(t>0){ pendingStopTimer[btnId]=setTimeout(()=>{ sendCommand("stop"); pendingStopTimer[btnId]=null; actionActive[btnId]=false; }, t); }
  // t==-1 => run until manual stop
}

function startActionForButton(btnId, triggeredBy){
  clearStartDelay(btnId);
  const delayMs    = (delayConfig && delayConfig[btnId]!==undefined)?delayConfig[btnId]:0;
  const actionTimer= (actionTimers && actionTimers[btnId]!==undefined)?actionTimers[btnId]:0;

  function doStart(){
    const btn=document.querySelector('button[data-id="'+btnId+'"]');
    if(btn) btn.classList.add("pressed");
    sendCommand(cmdFor(btnId));
    actionActive[btnId]=true;
    if(triggeredBy==="release" && actionTimer>0){
      clearPendingStop(btnId);
      pendingStopTimer[btnId]=setTimeout(()=>{
        sendCommand("stop"); pendingStopTimer[btnId]=null; actionActive[btnId]=false; if(btn) btn.classList.remove("pressed");
      }, actionTimer);
    }
  }

