BlueskyBV/Easy_Web_Remote_Control-ESP32-/src/EasyWebRemoteControl.cpp
  if(delayMs>0){
    startDelayTimer[btnId]=setTimeout(()=>{
      startDelayTimer[btnId]=null;
      if(triggeredBy==="press" && !pressActive[btnId]) return;
      doStart();
    }, delayMs);
  } else doStart();
}

// Attach behavior to every interactive (non-stop) button.
interactiveButtons.forEach(id=>{
  pressActive[id]=false; pressStart[id]=0; holdTimer[id]=null; actionActive[id]=false;
  startDelayTimer[id]=null; tapCount[id]=0; tapResetTimer[id]=null; pendingStopTimer[id]=null;
  const el=document.querySelector('button[data-id="'+id+'"]');
  if(!el) return;

  function onDown(e){ e&&e.preventDefault&&e.preventDefault(); pressActive[id]=true; pressStart[id]=Date.now(); clearPendingStop(id);
    const tapsNeeded=(tapConfig && tapConfig[id]!==undefined)?tapConfig[id]:0;
    const holdMs=(holdConfig && holdConfig[id]!==undefined)?holdConfig[id]:0;
    if(tapsNeeded===0){
      if(holdMs===0) startActionForButton(id,"press");
      else{ clearHoldTimeout(id); holdTimer[id]=setTimeout(()=>{ holdTimer[id]=null; if(pressActive[id]) startActionForButton(id,"press"); }, holdMs); }
    } else clearHoldTimeout(id);
  }

  function onUp(e){ e&&e.preventDefault&&e.preventDefault(); const now=Date.now(); const elapsed=now-(pressStart[id]||now); pressActive[id]=false; clearHoldTimeout(id);
    const tapsNeeded=(tapConfig && tapConfig[id]!==undefined)?tapConfig[id]:0;
    const holdMs=(holdConfig && holdConfig[id]!==undefined)?holdConfig[id]:0;

    if(tapsNeeded>0){
      if(holdMs===0 || elapsed>=holdMs){
        tapCount[id]=(tapCount[id]||0)+1; clearTapReset(id); tapResetTimer[id]=setTimeout(()=>{ tapCount[id]=0; tapResetTimer[id]=null; }, TAP_RESET_MS);
        if(tapCount[id]>=tapsNeeded){ startActionForButton(id,"release"); clearTapReset(id); tapCount[id]=0; }
      }
      return;
    }

    if(actionActive[id]){ scheduleStopIfNeeded(id); actionActive[id]=false; clearStartDelay(id); const btn=document.querySelector('button[data-id="'+id+'"]'); if(btn) btn.classList.remove("pressed"); return; }
    if(startDelayTimer[id]){ clearStartDelay(id); return; }
    if(holdMs>0 && elapsed<holdMs) return;
    scheduleStopIfNeeded(id); const btn=document.querySelector('button[data-id="'+id+'"]'); if(btn) btn.classList.remove("pressed");
  }

  function onLeave(e){ if(pressActive[id]) onUp(e); }

  el.addEventListener('mousedown', onDown);
  el.addEventListener('touchstart', onDown, {passive:false});
  el.addEventListener('mouseup', onUp);
  el.addEventListener('touchend', onUp);
  el.addEventListener('mouseleave', onLeave);
});

// STOP buttons (one or more) — cancel all timers and broadcast stop.
function stopAll(){
  Object.keys(startDelayTimer).forEach(k=>{ if(startDelayTimer[k]){ clearTimeout(startDelayTimer[k]); startDelayTimer[k]=null; } });
  Object.keys(pendingStopTimer).forEach(k=>{ if(pendingStopTimer[k]){ clearTimeout(pendingStopTimer[k]); pendingStopTimer[k]=null; } });
  Object.keys(tapResetTimer).forEach(k=>{ if(tapResetTimer[k]){ clearTimeout(tapResetTimer[k]); tapResetTimer[k]=null; } });
  Object.keys(holdTimer).forEach(k=>{ if(holdTimer[k]){ clearTimeout(holdTimer[k]); holdTimer[k]=null; } });
  Object.keys(pressActive).forEach(k=>{
    pressActive[k]=false; actionActive[k]=false; tapCount[k]=0;
    const btn=document.querySelector('button[data-id="'+k+'"]'); if(btn) btn.classList.remove("pressed");
  });
  sendCommand("stop");
}
stopButtons.forEach(id=>{
  const stopBtn=document.querySelector('button[data-id="'+id+'"]');
  if(!stopBtn) return;
  stopBtn.addEventListener('mousedown', stopAll);
  stopBtn.addEventListener('touchstart', stopAll, {passive:false});
});

// PWM slider
const slider=document.getElementById("pwmSlider");
const pwmValue=document.getElementById("pwmValue");
if(slider){
  slider.addEventListener("input", ()=>{
    pwmValue.textContent=slider.value;
    sendCommand("pwm:"+slider.value);
  });
}

// Snapshot refresh
(function(){
  if(!VIDEO_ENABLED) return;
  const img = document.getElementById('snapImg');
  if(!img) return;
  if(VIDEO_PAUSED || !SNAP_FPS || SNAP_FPS===0) return;
  const period = Math.max(200, Math.floor(1000/Math.min(SNAP_FPS, 30)));
  // Cand nu exista inca un cadru, serverul raspunde 204 No Content, iar
  // browserul ar afisa pictograma de imagine stricata. Stergem sursa la eroare,
  // asa incat caseta ramane curata pana la primul cadru valid.
  img.onerror = function(){ img.removeAttribute('src'); };
  function tick(){
    img.src = '/snapshot?t=' + Date.now();
  }
  tick();
  setInterval(tick, period);
})();
)JS"
"</script></body></html>";

    return page;
}
